#ifndef __RTC_H__
#define __RTC_H__

#include "standard.h"
#include "event.h"

class Rtc; // объявление класса RTC
typedef struct {
    u16 year;
    u8 month;
    u8 day;
    u8 hour;
    u8 minute;
    u8 second;
} rtc__datetime_t;

/*********************************************************************************
 * @brief Универсальный прототип коллбэка для всех асинхронных операций RTC.
 * @details Вызывается по завершению операции RTC.
 * @param rtc_instance Указатель на объект RTC, вызвавший коллбэк.
 * @param event Тип события, произошедшего (например, завершение инициализации, установки, получения, ошибка).
 * @param dateTime_data Данные времени и даты, действительные только для событий получения (GET).
 * @param ext_data Пользовательские данные, переданные при вызове асинхронной функции.
 *********************************************************************************/
using rtc__callback_t = void (*)(Rtc* rtc_instance, event__e event, const rtc__datetime_t& dateTime_data, void* ext_data);

class Rtc {
    protected:
        rtc__callback_t callback;
        void* ext_data;
    public:

/*********************************************************************************
 * @brief Конструктор модуляя
 * @param dateTime Структура с данными времени и даты для установки.
 *********************************************************************************/
        Rtc(const rtc__datetime_t& dateTime);
        Rtc();

/*********************************************************************************
 * @brief Диструктор модуля
 *********************************************************************************/
        ~Rtc();

/*********************************************************************************
 * @brief Перегрузка оператора ()
 * @param dateTime Структура с данными времени и даты для установки.
 *********************************************************************************/
        void operator()(const rtc__datetime_t& dateTime);

/*********************************************************************************
 * @brief Установка времени.
 * @param hour Час (0-23).
 * @param minute Минута (0-59).
 * @param second Секунда (0-59).
 * @param callback Указатель на функцию обратного вызова, вызываемую по завершению.
 * @param ext_data Пользовательские данные, которые будут переданы в коллбэк.
 * @return результат операции
 *********************************************************************************/
        event__e setTime(u8 hour, u8 minute, u8 second, rtc__callback_t callback, void* ext_data);

/*********************************************************************************
 * @brief Получение времени.
 * @param callback Указатель на функцию обратного вызова, вызываемую по завершению.
 * Коллбэк получит структуру DateTime_t.
 * @param ext_data Пользовательские данные, которые будут переданы в коллбэк.
 * @return результат операции
 *********************************************************************************/
        event__e getTime(rtc__callback_t callback, void* ext_data);

/*********************************************************************************
 * @brief Установка даты.
 * @param year Год (например, 2025).
 * @param month Месяц (1-12).
 * @param day День (1-31).
 * @param callback Указатель на функцию обратного вызова, вызываемую по завершению.
 * @param ext_data Пользовательские данные, которые будут переданы в коллбэк.
 * @return результат операции
 *********************************************************************************/
        event__e setDate(u16 year, u8 month, u8 day, rtc__callback_t callback, void* ext_data);

/*********************************************************************************
 * @brief Получение даты.
 * @param callback Указатель на функцию обратного вызова, вызываемую по завершению.
 * Коллбэк получит структуру DateTime_t.
 * @param ext_data Пользовательские данные, которые будут переданы в коллбэк.
 * @return результат операции
 *********************************************************************************/
        event__e getDate(rtc__callback_t callback, void* ext_data);

/*********************************************************************************
 * @brief Установка даты и времени.
 * @param dateTime Структура с данными времени и даты для установки.
 * @param callback Указатель на функцию обратного вызова, вызываемую по завершению.
 * @param ext_data Пользовательские данные, которые будут переданы в коллбэк.
 * @return результат операции
 *********************************************************************************/
        event__e setDateTime(const rtc__datetime_t& dateTime, rtc__callback_t callback, void* ext_data);

/*********************************************************************************
 * @brief Получение даты и времени.
 * @param callback Указатель на функцию обратного вызова, вызываемую по завершению.
 * Коллбэк получит структуру DateTime_t.
 * @param ext_data Пользовательские данные, которые будут переданы в коллбэк.
 * @return результат операции
 *********************************************************************************/
        event__e getDateTime(rtc__callback_t callback, void* ext_data);
};

#endif /* __RTC_H__ */